import random

# Список курсов
courses = 4

# Генерация имён менторов
mentor_names = [
    "Евгений Шмаргунов",
    "Олег Булыгин",
    "Дмитрий Демидов",
    "Кирилл Табельский",
    "Александр Ульянцев",
    "Александр Бардин",
    "Александр Иванов",
    "Антон Солонилин",
    "Максим Филипенко",
    "Елена Никитина",
    "Азамат Искаков",
    "Роман Гордиенко",
    "Филипп Воронов",
    "Анна Юшина",
    "Иван Бочаров",
    "Анатолий Корсаков",
    "Юрий Пеньков",
    "Илья Сухачев",
    "Иван Маркитан",
    "Ринат Бибиков",
    "Вадим Ерошевичев",
    "Тимур Сейсембаев",
    "Максим Батырев",
    "Никита Шумский",
    "Алексей Степанов",
    "Денис Коротков",
    "Антон Глушков",
    "Сергей Индюков",
    "Максим Воронцов",
    "Евгений Грязнов",
    "Константин Виролайнен",
    "Сергей Сердюк",
    "Павел Дерендяев",
    "Владимир Чебукин",
    "Эдгар Нуруллин",
    "Евгений Шек",
    "Валерий Хаслер",
    "Татьяна Тен",
    "Александр Фитискин",
    "Александр Шлейко",
    "Алена Батицкая",
    "Александр Беспоясов",
    "Денис Ежков",
    "Николай Лопин",
    "Михаил Ларченко",
]


def mentrand(mentor_names, course_num):
    return [random.sample(mentor_names, random.randint(5, 15)) for _ in range(course_num)]

print(mentrand(mentor_names, courses))